FlowmisOS.org
#+TITLE: Install FlowmisOS
#+STARTUP: fold

Diese Datei dient der Übersicht über FlowmisOS. Von hier aus werden die Konfigurationsdateien und Skripte gebildet <Space-mB> und in Ordner tangle exportiert. Der hier am Anfang vorhandene shell SourceBlock verschiebt alles aus dem tangle Ordner an die richtigen Orte (ausführbar mit <C-c C-c> mit Cursor innerhalb des SourceBlock).

#+begin_src shell
#cp -r ~/FlowmisOS/tangle/config.py ~/.config/qtile/config.py
#cp -r ~/FlowmisOS/tangle/config.el ~/.config/doom/config.el
#cp -r ~/FlowmisOS/tangle/init.el ~/.config/doom/init.el
#cp -r ~/FlowmisOS/tangle/packages.el ~/.config/doom/packages.el
#cp -r ~/FlowmisOS/tangle/launcher.sh ~/.config/rofi/launchers/misc/launcher.sh
#cp -r ~/FlowmisOS/tangle/mane.rasi ~/.config/rofi/launchers/misc/mane.rasi
#cp -r ~/FlowmisOS/tangle/.xprofile ~/.xprofile
#cp -r ~/FlowmisOS/tangle/config.fish ~/.config/fish/config.fish
#cp -r ~/FlowmisOS/tangle/.bashrc ~/.bashrc
#cp -r ~/FlowmisOS/tangle/config.rasi ~/.config/rofi/config.rasi
#cp -r ~/FlowmisOS/tangle/.gitconfig ~/.gitconfig
#cp -r ~/FlowmisOS/tangle/.git-credentials ~/.git-credentials
#cp -r ~/FlowmisOS/tangle/picom.conf ~/.config/picom/picom.conf
#cp -r ~/FlowmisOS/tangle/alacritty.yml ~/.config/alacritty/alacritty.yml
#cp -r ~/FlowmisOS/tangle/banner.png ~/.config/doom/banner.png
#cp -r ~/FlowmisOS/tangle/themes/ ~/.config/doom/themes
#cp -r ~/FlowmisOS/tangle/python-white.png ~/.config/qtile/pyhton-white.png
# wegen sudo in Terminal kopieren und dort ausführen bis ich es aus Emacs auch kann: sudo cp -r ~/FlowmisOS/tangle/70-synaptics.conf /etc/X11/xorg.conf.d/70-synaptics.conf
echo done
#+end_src

#+RESULTS:
: done

 1. ~Arch~ mit ~Linux-Kernel~ und der Paketverwaltung ~Pacman~ ist die Grundlage auf dem ich mein System aufbaue
 2. ~Bootstick/Iso~ mit ~Arch~ ist nötig um in ein ~live system~ booten zu können von dem aus man Arch, die gewollten Programme und Konfigurationsdateien installieren kann. Es ist machbar die heruntergeladene ISO zu bearbeiten (Iso Master - Linux) und ihr direkt ein Installationsskript mitzugeben, sodass man nach dem booten eigentlich nur noch das Installationsskript in der virtuellen zshell ausführen muss.

* TODO FlowmisOS
+ [ ] Kann ich Repo privat stellen und trotzdem leicht clonen um Installationsskripte auszuführen oder ist entsprechende Iso nötig
+ [ ] Alacritty sweeter machen, so dass ähnlicher zu fish shell
+ [ ] komplettes Skript für arch installations .iso herstellen und dann einfach immer in iso integrieren, sodass es alles von selbst installiert
+ [ ] lightdm aufhübschen
+ [ ] git ssh und in skript mit rein
+ [ ] Passwortdatei mit installieren lassen sodass ich mit decrypt key alle Passwörter auf Pc hab
+ [ ] mein .xprofile durch .xressources ersetzen so wie bei DT
+ [ ] Aussortieren dass nach installation alles unnötige gelöscht wird und minimum an Programmen etc vorhanden ist (während der installation geclonte repos mit sudo Gruppe rechten löschen und gegebenenfalls neu clonen als richtiger user)
+ [ ] ispell für deutsche Sprache
+ [ ] HDMI und zeite Bildschirme ebenso wie USB besser erkennen und formatieren können bzw Einstellungen machen können
+ [ ] Grafikkartenprobleme lösen (https://wiki.freedesktop.org/nouveau/Optimus/,... )
+ [ ] Qtile Widgets überarbeiten
+ [ ] Emacs eigene Modi einrichten und Skript so ändern dass von Beginn an funktioniert
+ [ ] .bashrc bashprofile und bashhistory zu configs
+ [ ] Dependencys für Qtile und Emacs in Installskript, sodass es von Beginn an top funzt -> Wenn alles clean und fertig dann nochmal Neuinstallation in VirtualBox testen

* Installation

1. Installation eines Linux Betriebssystems benötigt eigentlich immer folgende Komponenten
   - Bootmanager (grub)
   - xorg server, systemd (erster Prozess der ausgeführt wird und das starten/beenden etc. anderer Prozesse ermöglicht)
   - window/desktop manager (qtile, openbox, xmonad)
   - login manager (lightdm)
   - Browser (Brave)
   - Terminal/Terminal Emulator (Alacritty, Fish, zshell)
   - Texteditor (Emacs)

2. Für mein Betriebssystem wurde Arch als Grundlage geählt -> Arch ist ein Desktop Betriebssystem dass auf allen x86_64 kompatiblen Machinen mit circa 1 GiB Ram und etwa 2 GiB Speicher installiert werden kann

3. [[https://wiki.archlinux.org/title/Installation_guide][Arch InstallGuide]]:

4. Bootstick mit ArchLinux erstellen:
   - Iso [[https://archlinux.org/download/][downloaden]] und Bootstick erstellen (falls keine VM Installation) -> Auf Windows mit Rufus oder Etcher - [[https://wiki.archlinux.org/title/USB_flash_installation_medium][Alternativen für nicht Windows]]
   - PGP Signatur mit System auf dem GnupG installiert ist checken sodass man keinen Müll gedownloaded hat und installiert
    #+begin_src shell
    gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig     # Befehl PGP check
    pacman-key -v archlinux-version-x86_64.iso.sig                                          # Alternativer Befehl von ArchSystem aus
    #+end_src
   - Anmerkung: Arch Linux installation images supporten kein Secure Boot (-> disable Secure Boot to boot the installation medium). Auch auf Boot device Reihenfolge im Bios achten/anpassen um auf Stick zu booten. Booted man auf den Stick wird man in eine virtuelle Konsole (handelt sich um eine Zsh Shell) als root eingeloggt, von der aus man die gewünschte Installation durchführen kann. Theoretisch kann man ein Autoinstallationsskript in die ISO mit einbauen und dann über die Zsh ausführen (Ein Installationshelferskript liegt dort bereits und kann über <archinstall> gestartet werden)

5. In VM (other Linux 5.x or later Kernel 64bit und genug Speicher etc. geben)

6. Nach Boot und falls man nicht das archinstall skript verwenden will folgende Befehle eingeben um eigenes System aufzusetzen: *Befehle für quick setup sind mit * markiert*

#+begin_example
Keyboard konfigurieren:
  ls /sys/firmware/efi/efivars                              # kein Error = System hat in UEFI mode gebooted. Error (dir existiert nicht) = System im BIOS (or CSM) mode?
  ls /usr/share/kbd/keymaps/**/*.map.gz                    # Läd alle vorhandenen Tastaturlayouts
  loadkeys de-latin1                                        # Standard Tastaturlayout auf Deutsch (nur für Installationsprozess)

Internet konfigurieren:
  ip link                                                   # Zeigt einem an ob Netzwerkkarte/Hardware gefunden wird (Achtung dass rfkill die Karte nicht blockiert) und mit welchem Namen man es ansprechen kann (oft wlan0)
  iwctl                                                     # Einloggen ins Wlan (Ethernet macht es einfacher) -> siehe auch https://wiki.archlinux.org/title/Iwd#iwctl
  device list                                               # zeigt Netzwerkkarten -> ist hier nichts gelistet dann fucked
  station "" scan                                           # "" durch Wlan Karte ersetzen (meist wlan0) -> scant nach vorhandenen Wlans die durch Wlan Karte gefunden werden
  station "" get-networks                                   # Listet gefundene Wlan Netzwerke auf
  station "" connect "Name Wlan"                            # Verbindung zu Wlan herstellen
  exit                                                      # Verlassen von iwctl
  #DHCP: dynamic IP address and DNS server assignment (provided by systemd-networkd and systemd-resolved) should work out of the box for Ethernet, WLAN, and WWAN network interfaces.
  ping archlinux.org                                        # Internetcheck -> ISO hat systemd mit Internet etc. (später installiertes System hat es nicht) -> NetworkManager enablen mit systemctl

Speicher formatieren:
  *fdisk /dev/sda                                           # In VM: <n> <p> <Enter> <Enter> <Enter> <w>
    wenn keine VM:
      fdisk -l                                              # Alternativ: <lsblk> -> listet vorhandene Partitionen -> Man sollte alles löschen was man nicht braucht
      fdisk //dev//"Partitionsname"                           # mit fdisk in Partition gehen -> Partitionen löschen <d>/neue erstellen <n> -> <m> mögliche Befehle zeigen
      fdisk //dev//"Speicherort für Betriebssystem"           # in die für das Betriebssystem gewünschte Partition wechseln
      <g><n><1><Enter><+550M>                               # EFI Partition erstellen: <g> kreiert Label - GPT disk label (for what?) <n> neue Partition mit Nummer <1>  und first sector default <Enter> und second sector 550MiB <+550M>
      <n><2><Enter><+2G>                                    # Swap Partition mit Nummer 2 und mindesten 1GiB (oder wie hier 2GiB) erstellen
      <n><3><Enter><Enter>                                  # Linux Filesystem Partition mit restlichem Speicher erstellen
      <t><1><L><1>                                          # Partitionstypen ändern <t>: <1><L><1>   <- Partition 1 zu EFI ändern (<L> zeigt mögliche Partitionstypen und <1>=EFI)
      <t><2><19>                                            # Partition 2 von Standard Linux Filesystem Partition zu swap Partion verändern -> Partition 3 muss man nicht ändern da Standard passt
      <w>                                                   # write changes und fdisk verlassen
      mkfs.fat -F32 /dev/"EFI_Partitionsname/Partition1"    # Falls Namen nicht mehr bewusst sind mit "lsblk" alle möglichen Partitionen anzeigen lassen
      mkswap /dev/"swap_Partitionsname/Partition2"
      swapon /dev/"swap_Partitionsname/Partition2"
  *mkfs.ext4 /dev/sda1                                       # ACHTUNG: sda1 umbenennen in Namen der Partition 3 die mit Linux Filesystem erstellt wurde -> Linux Filesystem wird im Speicher angelegt
  *mount /dev/sda1 /mnt                                      # ACHTUNG: sda1 umbenenn in Namen der Partition 3 -> Einhängen des Speichers um Veränderungen vornehmen zu können
  *pacstrap /mnt base linux linux-firmware                   # Installiert die grundlegendsten Komponenten die man benötigt um mit dem Linux Kernel arbeiten zu können
  *genfstab -U /mnt >> /mnt/etc/fstab                        # generiert FileSystemTable
  *arch-chroot /mnt                                          # Mit root in /mnt gehen
  *pacman -S neovim sudo git
  *passwd
  *useradd -m flowmis
  *passwd flowmis
  *cd /home/flowmis
  *git clone https://github.com/flowmis/FlowmisOS.git
  *cd FlowmisOS/tangle
  *. rootinstall.sh
  *EDITOR=nvim visudo                                        # uncomment #%wheel ALL=(ALL) ALL
  *exit
  *umount -l /mnt
  *reboot & login
  *cd FlowmisOS/tangle
  *. install.sh
  *reboot und genießen :)
    #Eventuell neu in Wlan anmelden (nun mit NetworkManager statt wie zuvor mit iwctl)
    sudo NetworkManager                                          # keine Fehlermeldung = past alles
    sudo nmcli device wifi list                             # nmcli wird mit NetworkManager installiert und zeigt vorhandene Wlan Netzwerke an
    sudo nmcli device wifi connect "Name Wlan" password "Passwort Wlan"     # Verbindet mit Wlan (https://wiki.archlinux.org/title/NetworkManager)
#+end_example
** Troubleshooting:
_Zeit und Datum:_
  timedatectl set-ntp true                                    # Zeit und Datum über das network transfer protocol einholen
  timedatectl status                                          # Check ob alles passt

** Anfängervariante von Arch mit Desktop GUI:
Mit komfortabler GUI und float Window Manager wie man es von Windows kennt ist dies für Anfänger besser:
   - Arch wie oben beschrieben zum laufen bekommen und statt git clone FlowmisOS repo einfach gnome installieren und konfigurieren
    #+begin_src shell
    sudo pacman -S gnome                                             # intsalliert gnome Zeug für gui
    sudo pacman -S gnome-extra                                       # weitere dependencies und Zeug ~2GB
    #Anmerkung: Falls Probleme mit Servern einfach mal ping google.de versuchen und wenn das passt und man Internet hat dann sudo pacmann -Syyu und danach sollte download zeug gehen
    reboot
    sudo systemctl enable gdm                                        # login manager gdm starten und in gui einloggen (reboot nötig?)
    #+end_src
   Sonstiges:
    - openbox ist gut als Desktop geeignet und nach Start einfach nur ein grauer screen(mit rechtsklick checken ob es openbox funktioniert)
    - Nitrogen (gut für mehrere Monitore) für Wallpaper (In Nitogen ein durch git clone gesicherten Ordner mit Wallpapers auswählen (gnome-background kann man auch installieren mit pacman wenn man keine eigene Sammlung hat) -> Autostart File ist bei Nitrogen nötig)
        - Geh in .config und erstelle openbox directory und darin eine leere Datei autostart mit folgendem Inhalt und mache Datei ausführbar (in Filemanager über Properties, oder eben über permissions) -> reicht hier bereits aus für autostart (manchmal braucht es noch mehr wenn es die .config nicht automatisch findet uns ausführt)
        #+begin_src
        nitrogen --restore &    # setzt Wallpaper
        tint2                   # setzt Taskleiste/Panel
        #+end_src
* Skripte
+ Mit vim in Installationsskript gehen und es an das vorliegende System anpassen
+ ~Achtung!!!~ wenn ich ein englisches Keyboard-Layout verwenden will muss ich <s/#de_DE.UTF-8 UTF-8/de_DE.UTF-8 UTF-8/g> aus Root Skript und <sudo localectl --no-convert set-keymap de-latin1-nodeadkeys>, <sudo localectl --no-convert set-x11-keymap de pc105 deadgraveacute> <setxkbmap -layout de> ändern auf die Werte für eine englische Tastaut!
